import os




main_messages = (

)







attention_message = ("Ваш пробный период истек."
                    "\n\n*Скоро потребуется оплата.* "
                    "\nВы можете пригласить друзей нажав кнопку поделиться."
                    "\n\nЗа каждого друга который перешел по вашей ссылке - *3 бесплатных дня доступа*. "
                    "\n\nЕсли ваш друг оплатил подписку - *10 дней бесплатного доступа и 20 гб трафика*."
                    "\n\n*Подскажите как у вас работает подключение?*" )





# detailed_instructions_message = (
#     "📜 *Подробная инструкция* 📜\n\n"
#     "Для использования нашего VPN, вам необходимо:\n\n"
#     "1. Установить приложение WireGuard на ваше устройство.\n"
#     "2. Сканировать QR-код с конфигурацией, который мы вам отправили. Вы можете сделать это используя приложение WireGuard. \n QR код можно переслать другу или на другое устройство \n"
#     "3. Загрузить конфигурацию в приложении и задать имя pingi_vingi.\n\n"
#     "После этого вы можете пользоваться)\n"
#     "Если у вас возникнут вопросы, не стесняйтесь обращаться к нашей поддержке.😊"
#
# )
