import os




main_messages = (

)







attention_message = ("Ваш пробный период истек."
                    "\n\n*Скоро потребуется оплата.* "
                    "\nВы можете пригласить друзей нажав кнопку поделиться."
                    "\n\nЗа каждого друга который перешел по вашей ссылке - *3 бесплатных дня доступа*. "
                    "\n\nЕсли ваш друг оплатил подписку - *10 дней бесплатного доступа и 20 гб трафика*."
                    "\n\n*Подскажите как у вас работает подключение?*" )





